; domain
;Header and description

(define (domain dominio-mono)

;remove requirements that are not needed
(:requirements :strips :typing :negative-preconditions)

(:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
    posicion entidadMono entidadCaja  entidadBanana - object
)

; un-comment following line if constants are needed
;(:constants )

(:predicates ;todo: define predicates here
    (localizacion ?ent - entidadMono ?pos - posicion)
    (localizacionCaja ?ent - entidadCaja ?pos - posicion)
    (localizacionBanana ?ent - entidadBanana ?pos - posicion)
    (inc ?x - posicion ?y - posicion)
    (concaja ?ent - entidadMono)
    (encimacaja ?ent - entidadMono ?caja - entidadCaja)
    (recojebanana ?ent - entidadMono ?banana - entidadBanana)
)

(:action mover-mono
    :parameters (?mono - entidadMono ?posOri - posicion ?posDest - posicion)
    :precondition (and 
        (localizacion ?mono ?posOri)
        (inc ?posOri ?posDest)
        (not (concaja ?mono))
    )
    :effect (and 
        (not (localizacion ?mono ?posOri))
        (localizacion ?mono ?posDest)       
    )
)



(:action encontrar-mono-caja
    :parameters (?mono - entidadMono ?caja - entidadCaja ?pos - posicion)
    :precondition (and 
        (localizacion ?mono ?pos)        
        (localizacionCaja ?caja ?pos)
        (not (concaja ?mono))
    )
    :effect (and         
        (concaja ?mono)
    )
)

(:action subir-mono-caja
    :parameters (?mono - entidadMono ?caja - entidadCaja ?pos - posicion)
    :precondition (and 
        (localizacion ?mono ?pos)        
        (localizacionCaja ?caja ?pos)
        (concaja ?mono)        
        (not(encimacaja ?mono ?caja))
    )
    :effect (and 
        (encimacaja ?mono ?caja)               
    )
)

(:action bajar-mono-caja
    :parameters (?mono - entidadMono ?caja - entidadCaja ?pos - posicion)
    :precondition (and 
        (localizacion ?mono ?pos)        
        (localizacionCaja ?caja ?pos)
        (concaja ?mono)        
        (encimacaja ?mono ?caja)
    )
    :effect (and 
        (not(encimacaja ?mono ?caja))
    )
)

(:action recoger-mono-banana
    :parameters (?mono - entidadMono ?caja - entidadCaja ?banana - entidadBanana ?pos - posicion)
    :precondition (and
        (localizacion ?mono ?pos)
        (localizacionCaja ?caja ?pos)                         
        (localizacionBanana ?banana ?pos)                         
        (encimacaja ?mono ?caja)        
    )
    :effect (and 
        (recojebanana ?mono ?banana)        
    )
)

(:action empujar-mono-caja
    :parameters (?mono - entidadMono ?caja - entidadCaja ?posOri - posicion ?posDest - posicion)
    :precondition (and 
        (localizacion ?mono ?posOri)
        (localizacionCaja ?caja ?posOri)
        (inc ?posOri ?posDest)
        (concaja ?mono)
        (not(encimacaja ?mono ?caja))
    )
    :effect (and 
        (not (localizacion ?mono ?posOri))
        (not (localizacionCaja ?caja ?posOri))
        (localizacion ?mono ?posDest)
        (localizacionCaja ?caja ?posDest)       
    )
)



;define actions here

)

; problem
(define (problem problema-mono-caja-banana) (:domain dominio-mono)
(:objects 
    p1 p2 p3 - posicion
    m1 - entidadMono
    c1 - entidadCaja
    b1 - entidadBanana
)

(:init
    ;todo: put the initial state's facts and numeric values here
    (inc p1 p2)
    (inc p2 p3)
    (inc p3 p2)
    (inc p2 p1)
    (localizacion m1 p3)    
    (localizacionCaja c1 p1)
    (localizacionBanana b1 p2)
)

(:goal (and
    ;todo: put the goal condition here    
    (recojebanana m1 b1)
))

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (mover-mono m1 p3 p2)
   deleted: (localizacion m1 p3)
   added: (localizacion m1 p2)
   goals met: 0 of 1
2. (mover-mono m1 p2 p1)
   deleted: (localizacion m1 p2)
   added: (localizacion m1 p1)
   goals met: 0 of 1
3. (encontrar-mono-caja m1 c1 p1)
   added: (concaja m1)
   goals met: 0 of 1
4. (empujar-mono-caja m1 c1 p1 p2)
   deleted: (localizacion m1 p1) (localizacioncaja c1 p1)
   added: (localizacion m1 p2) (localizacioncaja c1 p2)
   goals met: 0 of 1
5. (subir-mono-caja m1 c1 p2)
   added: (encimacaja m1 c1)
   goals met: 0 of 1
6. (recoger-mono-banana m1 c1 b1 p2)
   added: (recojebanana m1 b1)
   goals met: 1 of 1
